[
  {
    "sectionheadline": "CSE Hub Privacy Policy",
    "lastUpdated": "August 29, 2024",
    "date": "This Policy was last updated ",
    "intro": {
      "text": "CSE Hub (“CSE Hub,” “we,” “our,” or “us”) is committed to protecting your privacy. Our Privacy Policy (the “Policy”) explains how we collect, use, disclose, and protect information about you or associated with you (“personal information”), and your choices about the collection and use of your information. This Privacy Policy applies to the online services offered by CSE Hub such as our website at ",
      "link": {
        "text": "www.csehub.com",
        "url": "/terms"
      },
      "continuation": " and any other online service location (collectively the “Service”) that makes this Privacy Policy available to you."
    },
    "continue": {
      "text": "By using the Service, you agree to our ",
      "link": {
        "text": "Terms of Service",
        "url": "/terms"
      },
      "continuation": " and consent to our collection, use, and disclosure practices, and other activities as described in this Privacy Policy. If you do not agree and consent, please discontinue use of the Service."
    },
    "contactSection": "If you have any questions or wish to exercise your rights and choices, please contact us as set out in the “Contact Us” section."
  },
  {
    "sectionheadline": [
      "Information Collection",
      "Use of Information",
      "Sharing of Information",
      "Analytics and Advertising",
      "Your Rights and Choices",
      "Data Security",
      "Changes to this Privacy Policy",
      "Contact Us"
    ],
    "sectiontextheadline": [
      "This section discusses the types of information we collect, including categories of information that (1) you provide to us directly, (2) is collected by us automatically, and (3) we receive from third-party sources.",
      "This section discusses how collected information is used by CSE Hub.",
      "This section explains our sharing practices with respect to information collected.",
      "We use analytics services, such as Google Analytics, to help us understand how users access and use the Service. Additionally, we work with agencies, advertisers, ad networks, and other technology services to place ads about our products and services on other websites and platforms. For example, we place ads through Google and Facebook, which you may view on their platforms as well as on other websites and services.",
      "You have rights and choices regarding your information, which may vary depending on the category of information and how it is used. This section describes your rights.",
      "CSE Hub employs commercially reasonable administrative, technical, and physical security measures designed to protect the integrity and security of all information collected through our Service. However, no security system is impenetrable, and we cannot guarantee the absolute security of our systems. In the event that any information under our control is compromised due to a security breach, we will take reasonable and appropriate steps to investigate the situation, notify the affected individuals in accordance with applicable laws and regulations, and take other necessary actions. Your privacy settings may also be impacted by changes to the functionality of third-party sites and services that you connect to the CSE Hub Service, such as social networks. CSE Hub is not responsible for the functionality or security measures of any third-party services.",
      "CSE Hub reserves the right to modify or update this Privacy Policy periodically to reflect changes in our business and practices. You should review this page regularly to stay informed about any updates. When we make changes to the policy, we will update the 'last modified' date at the top of this Privacy Policy."
    ],
    "secondheadlines": [
      [
        "Information You Provide Directly to Us",
        "Information Collected Automatically",
        "Information From Other Sources"
      ],
      [
        "Account Information",
        "Tracking Technology Choices",
        "Analytics and Interest-Based Advertising",
        "Communications",
        "Portability, Deletion, Management"
      ]
    ],
    "textundersecondheadlines": [
      [
        [
          "You can browse our site without providing personal information, but you must register to access most features of our Service. Certain personal information—such as a username and email address—are required to create an account. After setting up an account, you may choose to share additional information through public profiles, including your name, location, website, social media links, and other personal information. Should you engage in messaging through the Service, the contents of such messages may be processed and saved by us. You may also voluntarily provide other information that we do not request, and in such instances, you are solely responsible for such information.",
          "The following are categories of information we collect and have collected directly from you in the last 12 months:",
          "You may choose to voluntarily provide other information to us, and in such instances, you are solely responsible for such information."
        ],
        [
          "In addition, we automatically collect information when you use the Service. The categories of information we automatically collect and have collected in the last 12 months include:",
          "We use various current—and later—developed tracking technologies to automatically collect information when you use the Service, including:",
          "For further information on how we use tracking technologies for analytics and advertising, and your rights and choices regarding them, see the “Analytics and Advertising” and “Your Rights and Choices” sections below."
        ],
        [
          "We also collect information from other sources. The categories of sources we collect information from, including in the last 12 months, include:"
        ]
      ],
      [
        [
          "We collect this information for various business purposes, including operating, maintaining, and providing you with the features and functionality of the Service, as well as communicating directly with you, such as by sending email messages.",
          "The categories with respect to our business purposes for using information, including in the last 12 months, include:",
          "Notwithstanding the above, we may use information that does not identify you (including information that has been aggregated or de-identified) for any purpose except as prohibited by applicable law. For information on your rights and choices regarding how we use information about you, please see the “Your Rights and Choices” section below."
        ]
      ],
      [
        [
          "We share information we collect in accordance with the practices described in this Privacy Policy. The categories of entities to whom we disclose and have shared information with in the last 12 months, include the following:",
          "Notwithstanding the above, we may share information that does not identify you (including information that has been aggregated or de-identified) except as prohibited by applicable law. For information on your rights and choices regarding how we share information about you, please see the “Your Rights and Choices” section below."
        ]
      ],
      [
        [
          "As part of this process, we may incorporate tracking technologies into our Service (including our website and emails) and into our ads displayed on other websites and services. Some of these tracking technologies may monitor your activities over time and across different services to associate the various devices you use, delivering relevant ads and/or other content to you (“Interest-based Advertising”).",
          "We also use audience matching services to reach people (or people similar to people) who have visited our Service or are identified in one or more of our databases (“Matched Ads”). This is done by uploading a customer list to a technology service or incorporating a pixel from a technology service into our Service, and the technology service matches common factors between our data and their data. For instance, we incorporate the Facebook pixel on our Service and may share your email address with Facebook as part of our use of Facebook Custom Audiences. Some technology services may provide us with their own data, which is then uploaded into another technology service for matching common factors between those datasets.",
          "As indicated above, vendors may act as our service providers or, in certain contexts, independently decide how to process your information. We encourage you to familiarize yourself with and consult their privacy policies and terms of use.",
          "For further information on the types of tracking technologies we use on the Service and your rights and choices regarding analytics, Interest-based Advertising, and Matched Ads, please see the “Information Collected Automatically” and “Your Rights and Choices” sections."
        ]
      ],
      [
        [
          "You can access, update, or delete certain information you have provided through your account settings. Please note that we retain and use your information as necessary to comply with legal obligations, resolve disputes, and enforce our agreements."
        ],
        [
          "Disabling tracking technologies may affect the functionality of some parts of the Service."
        ],
        [
          "Google provides tools to opt out of certain information collected by Google Analytics at https://tools.google.com/dlpage/gaoptout and by Google Analytics for Display Advertising or the Google Display Network at https://www.google.com/settings/ads/onweb/ ."
        ],
        [
          "Companies providing targeted ads are required to give you the choice to opt out. Most participate in the Digital Advertising Alliance (“DAA”) and/or the Network Advertising Initiative (“NAI”). Learn more and opt out of certain targeted ads at https://www.aboutads.info/choices , https://www.aboutads.info/appchoices, and https://www.networkadvertising.org/choices/ ."
        ],
        [
          "To opt out of matched ads, contact us as specified in the “Contact Us” section below, or directly contact the applicable technology service.",
          "You can also limit our use of information collected from your mobile device for targeted ads by selecting “Limit Ad Tracking” (for iOS) or “Opt out of Interest-Based Ads” (for Android) in your device settings.",
          "Opting out using these methods only applies to the specific browser or device from which you opt out. We are not responsible for the effectiveness of any opt out options or programs."
        ],
        [
          "Note that your opt out is limited to the email address and device used and will not affect subsequent subscriptions."
        ],
        [
          {
            "text": "Request information about the data we collected, request deletion of your personal information, or manage your personal information settings through Settings > Privacy & Security > Data Management or",
            "link": {
              "text": "Help Center",
              "url": "/help"
            },
            "bold": ["Settings > Privacy & Security > Data Management"],
            "continuation": ". Specify which right you wish to exercise and the scope of your request. We will confirm receipt of your request within 10 days and may require specific information to verify your identity and process your request."
          }
        ],

        [
          "if your personal information has been processed by us as a service provider on behalf of a corporate or school customer, direct your rights request to the customer. If making the request directly to us, provide the name of the customer, and we will support them in responding to your request as required by law."
        ],
        [
          "CSE Hub employs commercially reasonable administrative, technical, and physical security measures designed to protect the integrity and security of all information collected through our Service. However, no security system is impenetrable, and we cannot guarantee the absolute security of our systems. In the event that any information under our control is compromised due to a security breach, we will take reasonable and appropriate steps to investigate the situation, notify the affected individuals in accordance with applicable laws and regulations, and take other necessary actions. Your privacy settings may also be impacted by changes to the functionality of third-party sites and services that you connect to the CSE Hub Service, such as social networks. CSE Hub is not responsible for the functionality or security measures of any third-party services."
        ],
        [
          "CSE Hub reserves the right to modify or update this Privacy Policy periodically to reflect changes in our business and practices. You should review this page regularly to stay informed about any updates. When we make changes to the policy, we will update the 'last modified' date at the top of this Privacy Policy."
        ],
        [
          {
            "text": "If you have any questions about this Privacy Policy, our data practices, our compliance with applicable laws, or the Service, please reach out to us by submitting a ticket through our",
            "link": {
              "text": "Help Center",
              "url": "/help"
            },
            "continuation": ", or by contacting us at:"
          },
          "CSE Hub, Soumaa, Blida, 09022, Algeria",
          "This Privacy Policy has been designed to be accessible to people with disabilities. If you encounter any difficulties accessing the information, please contact us through the Help Center."
        ]
      ]
    ],
    "penheads": [
      [
        {
          "headline": "Contact Data ",
          "text": "Includes your first and last name, email address, postal address, and phone number."
        },
        {
          "headline": "Account Credentials ",
          "text": "Includes your username, password, password hints, and information for authentication and account access."
        },
        {
          "headline": "Demographic ",
          "text": "Includes your age, gender, and country."
        },
        {
          "headline": "Billing Data ",
          "text": "Includes your payment instrument number (such as a credit or debit card number), expiration date, and security code necessary to process your payments."
        },
        {
          "headline": "Profile Data ",
          "text": "Includes your interests, inferences, preferences, and favorites."
        },
        {
          "headline": "Content ",
          "text": "Includes content within any messages you send to us (such as feedback and questions to customer support) or publicly post on the Service (such as in your public profile, reviews, and comments), as well as any academic content you generate and submit for grading. We also collect content within any messages you exchange with other users through the Service (such as if you use our chat functionalities)."
        },
        {
          "headline": "Personal Contacts Data ",
          "text": "Includes the first and last name, email address, and phone number of your personal contacts. We collect data about your contacts with your consent and to fulfill a request by you, such as finding your contacts on the Service or inviting your contacts to join the Service. Such functionality is intended only for U.S. residents. By using this functionality, you acknowledge and agree that both you and your contacts are based in the U.S. and that you have your contacts’ consent for us to use their contact information to fulfill your request."
        },
        {
          "headline": "Job Applicant Data ",
          "text": "Includes your employment and education history, transcript, writing samples, and references necessary to consider your job application for open positions."
        }
      ],
      [
        {
          "headline": "Service Use Data ",
          "text": "Includes data about features you use, pages you visit, emails and advertisements you view, products and services you view and purchase, the time of day you browse, and your referring and exiting pages."
        },
        {
          "headline": "Device Data ",
          "text": "Includes data about the type of device or browser you use, your device's operating software, your internet service provider, your device's regional and language settings, and device identifiers such as IP address."
        },
        {
          "headline": "Location Data ",
          "text": "Includes imprecise location data (such as location derived from an IP address or data that indicates a city or postal code level) and, with your consent, precise location data (such as latitude/longitude data)."
        }
      ],
      [
        {
          "headline": "Log Files ",
          "text": "Files that record events that occur in connection with your use of the Service."
        },
        {
          "headline": "Cookies ",
          "text": "Small data files stored on your device that act as a unique tag to identify your browser. We use two types of cookies: session cookies and persistent cookies. Session cookies make it easier for you to navigate our website and expire when you close your browser. Persistent cookies help with personalizing your experience, remembering your preferences, and supporting security features. Additionally, persistent cookies allow us to bring you advertising both on and off the Service. Persistent cookies may remain on your device for extended periods and generally may be controlled through your browser settings."
        },
        {
          "headline": "Pixels ",
          "text": "Code embedded in a website, video, email, or advertisement that sends information about your use to a server. Pixels are used in combination with cookies to track activity by a particular browser on a particular device. We may incorporate pixels from separate entities that allow us to track our conversions, bring you advertising both on and off the Service, and provide you with additional functionality, such as the ability to connect our Service with your social media account."
        },
        {
          "headline": "Device Fingerprinting ",
          "text": "The process of analyzing and combining sets of data elements from your device's browser, such as JavaScript objects and installed fonts, to create a 'fingerprint' of your device and uniquely identify your browser and device."
        },
        {
          "headline": "App Technologies ",
          "text": "Technologies included in our apps that are not browser-based like cookies and cannot be controlled by browser settings. For example, our apps may include SDKs, which is code that sends information about your use to a server. These SDKs allow us to track our conversions, bring you advertising both on and off the Service, and provide you with additional functionality, such as the ability to connect our Service with your social media account."
        },
        {
          "headline": "Location-Identifying Technologies ",
          "text": "Technologies used to collect your location. For example, GPS, Wi-Fi, and Bluetooth may be used to collect precise location data when you consent to precise location tracking through our apps. Location data may be used for purposes such as verifying your device's location and delivering or restricting relevant content and advertising based on that location."
        }
      ],
      [
        {
          "text": "Data brokers or resellers from which we purchase data to supplement the data we collect."
        },
        {
          "text": "Social networks when you engage with our content, reference our Service, or grant us permission to access information from the social networks."
        },
        {
          "text": "Partners that offer co-branded services, sell or distribute our products, or engage in joint marketing activities."
        },
        {
          "text": "Publicly-available sources, including data in the public domain."
        }
      ],
      [
        {
          "text": "Operate and manage our Service: Including your registration and account."
        },
        {
          "text": "Perform services requested by you: Such as responding to your comments, questions, and requests, and providing customer service."
        },
        {
          "text": "Sending you technical notices: Updates, security alerts, information regarding changes to our policies, and support and administrative messages."
        },
        {
          "text": "Preventing and addressing fraud: Breach of policies or terms, and threats or harm."
        },
        {
          "text": "Monitoring and analyzing trends: Usage, and activities."
        },
        {
          "text": "Conducting research: Including focus groups and surveys."
        },
        {
          "text": "Improving the Service: Including other CSE Hub websites, apps, marketing efforts, products, and services."
        },
        {
          "text": "Developing and sending you direct marketing: Including advertisements and communications about our and other entities’ products, offers, promotions, rewards, events, and services."
        },
        {
          "text": "Conducting promotions: Including verifying your eligibility and delivering prizes in connection with your entries."
        },
        {
          "text": "Sending you advertising"
        },
        {
          "text": "Fulfilling any other business or commercial purposes: At your direction or with your notice and/or consent."
        }
      ],
      [
        {
          "headline": "Service Providers ",
          "text": "We share information with entities that process information on our behalf for our business purposes. Service providers assist us with services such as payment processing, data analytics, marketing and advertising, website hosting, and technical support."
        },
        {
          "headline": "Vendors and Other Parties ",
          "text": "We share information with vendors for business and commercial purposes, including analytics and advertising technology companies. Vendors may act as our service providers or independently decide how to process your information."
        },
        {
          "headline": "Affiliates ",
          "text": "We share information with our related entities, including our parent and sister companies, for business purposes such as customer support, marketing, and technical operations."
        },
        {
          "headline": "Corporate and School Customers ",
          "text": "We share information with our corporate customers and schools to facilitate your account maintenance and administer student performance data."
        },
        {
          "headline": "Partners ",
          "text": "We share information with our partners in connection with offering co-branded services, selling or distributing our products, or engaging in joint marketing activities."
        },
        {
          "headline": "Promotions ",
          "text": "When you enter a promotion, we share information as set out in the official rules of that promotion, and allow the sponsor or other entities to use your name, voice, and/or likeness in advertising or marketing materials."
        },
        {
          "headline": "Public Information ",
          "text": "We share information you make public through the Service, such as information in your profile or public boards. Once posted, this information cannot easily be deleted."
        },
        {
          "headline": "Merger or Acquisition ",
          "text": "We share information in connection with or during negotiations of an acquisition or business combination involving our assets."
        },
        {
          "headline": "Security and Compelled Disclosure ",
          "text": "We share information to comply with legal processes and protect the rights, property, and safety of our Service, users, or others."
        },
        {
          "headline": "Facilitating Requests ",
          "text": "We share information at your request or direction, such as when you choose to share information with a social network about your activities on the Service."
        },
        {
          "headline": "Consent ",
          "text": "We share information with notice to you and upon your consent."
        }
      ],
      [
        {
          "headline": "Cookies and Pixels ",
          "text": "Most browsers accept cookies by default. You can change your browser settings to decline or delete cookies. Each browser on your device must be set individually. Limiting cookies is subject to your browser settings and limitations."
        },
        {
          "headline": "Do Not Track ",
          "text": "Your browser settings may allow you to send a 'Do Not Track' signal to online services. However, there is no industry consensus on how to respond to these signals, and we do not monitor or take action with respect to 'Do Not Track' signals unless required by law. For more information, visit http://www.allaboutdnt.com ."
        },
        {
          "headline": "App and Location Technologies ",
          "text": "You can stop all collection of information via an app by uninstalling it. You can also reset your device Ad ID through your device settings to limit information collected about you. Stop all collection of precise location data by uninstalling the app or withdrawing consent through device settings."
        }
      ],
      [
        {
          "headline": "Emails ",
          "text": "You can opt out of receiving promotional emails by following the unsubscribe instructions in emails or by contacting us through the 'Contact Us' section. Non-promotional emails about your account, transactions, servicing, or ongoing business relations cannot be opted out of."
        },
        {
          "headline": "Push Notifications ",
          "text": "Opt out of push notifications by adjusting permissions in your device settings or uninstalling our app."
        }
      ]
    ]
  }
]
