[
  {
    "sectionheadline": "CSE Hub Terms of Service",
    "intro": {
      "continuation": "Welcome to CSE Hub, the online platform provided by CSE Hub (\"CSE Hub,\" \"we,\" or \"us\"). This page outlines the terms under which you may access and use our online services, website, and any related software (collectively, the \"Service\"). By accessing or using the Service, you acknowledge that you have read, understood, and agree to be bound by these Terms of Service (\"Agreement\") and consent to the collection and use of your information as described in the CSE Hub Privacy Policy, whether or not you are a registered user. This Agreement applies to all visitors, users, and anyone else who accesses the Service (\"Users\")."
    },
    "continue": {
      "continuation": "PLEASE READ THIS AGREEMENT CAREFULLY TO ENSURE THAT YOU UNDERSTAND EACH PROVISION. THIS AGREEMENT INCLUDES A MANDATORY ARBITRATION CLAUSE THAT REQUIRES RESOLVING DISPUTES THROUGH INDIVIDUAL ARBITRATION RATHER THAN JURY TRIALS OR CLASS ACTIONS."
    }
  },
  {
    "sectionheadline": [
      "Use of Our Service",
      "User Content",
      "User Content License Grant",
      "Our Proprietary Rights",
      "Privacy",
      "Security",
      "Third-Party Links",
      "No Warranty",
      "Limitation of Liability",
      "Governing Law and Arbitration",
      "Termination",
      "General"
    ],
    "sectiontextheadline": [
      "CSE Hub provides an online interactive platform for accessing and creating educational content, specifically focused on computer science courses aligned with the Algerian university curriculum.",
      "Certain areas of the CSE Hub Service allow Users to post content, such as profile information, comments, questions, course content, and other materials (collectively referred to as \"User Conten\"). Access to these features may be subject to age restrictions. CSE Hub does not claim ownership rights over the User Content you create. The User Content you create remains yours; however, by sharing User Content through the Service, you agree to allow others to view, edit, and/or share your User Content in accordance with your settings and this Agreement. CSE Hub reserves the right (but not the obligation) to remove any User Content at its sole discretion.",
      "By posting any User Content on the CSE Hub Service, you expressly grant, and represent and warrant that you have all rights necessary to grant, to CSE Hub a royalty-free, sublicensable, transferable, perpetual, irrevocable, non-exclusive, worldwide license to use, reproduce, modify, publish, list information regarding, edit, translate, distribute, syndicate, publicly perform, publicly display, and create derivative works of all such User Content and your name, voice, and/or likeness as contained in your User Content, in whole or in part, and in any form, media, or technology, whether now known or hereafter developed, for use in connection with the Service and CSE Hub’s business, including without limitation for promoting and redistributing part or all of the Service (and derivative works thereof) in any media formats and through any media channels. You also hereby grant each User of the Service a non-exclusive license to access your User Content through the Service and to use, display, reproduce, and perform such User Content solely as permitted through the functionality of the Service and under this Agreement.",
      "Except for your User Content, the Service and all materials therein or transferred thereby, including, without limitation, software, images, text, graphics, illustrations, logos, patents, trademarks, service marks, copyrights, photographs, audio, videos, music, and User Content belonging to other Users (the “CSE Hub Content”), and all Intellectual Property Rights related thereto, are the exclusive property of CSE Hub and its licensors (including other Users who post User Content to the Service). Except as explicitly provided herein, nothing in this Agreement shall be deemed to create a license in or under any such Intellectual Property Rights, and you agree not to sell, license, rent, modify, distribute, copy, reproduce, transmit, publicly display, publicly perform, publish, adapt, edit or create derivative works from any CSE Hub Content. Use of the CSE Hub Content for any purpose not expressly permitted by this Agreement is strictly prohibited.",
      "We care about the privacy of our Users. By using the Service, you consent to the collection, use, and disclosure of your personally identifiable information and aggregate data as described in our Privacy Policy, and you agree to have your personally identifiable information collected, used, transferred to, and processed in accordance with applicable privacy laws and regulations.",
      "We are committed to protecting the integrity and security of your personal information. However, we cannot guarantee that unauthorized third parties will never be able to bypass our security measures or misuse your personal information. You acknowledge that you provide your personal information at your own risk.",
      "The Service may include links to third-party websites, advertisers, services, special offers, or other activities not owned or controlled by CSE Hub. We do not endorse or take responsibility for any third-party sites, information, materials, products, or services. If you choose to access a third-party website through our Service, you do so at your own risk, and you understand that this Agreement and our Privacy Policy do not apply to your use of those sites. You agree to hold CSE Hub harmless from any and all liability arising from your use of any third-party website, service, or content. Furthermore, any dealings with or participation in promotions from advertisers found on the Service, including payment and delivery of goods and any other terms (such as warranties), are solely between you and the advertiser. We are not responsible for any loss or damage related to your dealings with such advertisers.",
      "THE SERVICE IS PROVIDED ON AN “AS IS” AND “AS AVAILABLE” BASIS. YOUR USE OF THE SERVICE IS AT YOUR OWN RISK. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICE IS PROVIDED WITHOUT WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. WITHOUT LIMITING THE FOREGOING, CSE Hub, ITS SUBSIDIARIES, AFFILIATES, AND LICENSORS DO NOT WARRANT THAT THE CONTENT IS ACCURATE, RELIABLE, OR CORRECT; THAT THE SERVICE WILL MEET YOUR REQUIREMENTS; THAT THE SERVICE WILL BE AVAILABLE AT ANY PARTICULAR TIME OR LOCATION, UNINTERRUPTED OR SECURE; THAT ANY DEFECTS OR ERRORS WILL BE CORRECTED; OR THAT THE SERVICE IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. ANY CONTENT DOWNLOADED OR OTHERWISE OBTAINED THROUGH THE USE OF THE SERVICE IS DOWNLOADED AT YOUR OWN RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM OR MOBILE DEVICE OR LOSS OF DATA THAT RESULTS FROM SUCH DOWNLOAD OR YOUR USE OF THE SERVICE.",
      "TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL CSE Hub, ITS AFFILIATES, AGENTS, DIRECTORS, EMPLOYEES, SUPPLIERS, OR LICENSORS BE LIABLE FOR ANY INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR EXEMPLARY DAMAGES, INCLUDING WITHOUT LIMITATION DAMAGES FOR LOSS OF PROFITS, GOODWILL, USE, DATA, OR OTHER INTANGIBLE LOSSES ARISING OUT OF OR RELATING TO THE USE OF, OR INABILITY TO USE, THE SERVICE. UNDER NO CIRCUMSTANCES WILL CSE Hub BE RESPONSIBLE FOR ANY DAMAGE, LOSS, OR INJURY RESULTING FROM HACKING, TAMPERING, OR OTHER UNAUTHORIZED ACCESS OR USE OF THE SERVICE OR YOUR ACCOUNT OR THE INFORMATION CONTAINED THEREIN."
    ],
    "secondheadlines": [
      [
        "A. Eligibility",
        "B. CSE Hub Service",
        "C. CSE Hub Accounts",
        "D. Service Rules"
      ],
      ["A. Governing Law", "B. Arbitration"],
      ["A. Termination by You", "B. Termination by CSE Hub"],
      [
        "A. Assignment",
        "B. Notification Procedures and Changes to the Agreement",
        "C. Entire Agreement/Severability",
        "D. No Waiver",
        "E. Government Use Rights",
        "F. Contact"
      ]
    ],
    "textundersecondheadlines": [
      [
        [
          "This is a contract between you and CSE Hub. You must read and agree to these Terms before using the CSE Hub Service. If you do not agree, you may not use the Service. You must be 16 years or older to use the Service. If you are under 16 years of age and would like to register to use any part of the Service, please ask your parent or legal guardian to review and agree to these Terms before you use any part of the Service, or ask them to complete the registration on your behalf. Supplemental terms and conditions may apply to some features of the Service, such as specific courses, activities, or competitions. These supplemental terms will be disclosed to you in connection with such features and will prevail over these Terms in the event of a conflict. The Service is not available to any Users previously removed from the Service by CSE Hub."
        ],
        [
          "Subject to the terms and conditions of this Agreement, you are granted a non-exclusive, limited, non-transferable, and revocable license to use the Service for your personal, non-commercial, educational purposes only. CSE Hub reserves all rights not expressly granted herein regarding the Service and its content. CSE Hub may terminate this license at any time, for any reason or no reason, without notice."
        ],
        [
          "Your CSE Hub account grants you access to the services and functionality that we may establish and maintain from time to time at our sole discretion. By connecting to CSE Hub with a third-party service (for example, Google or Facebook), you grant us permission to access and use your information from that service as permitted by that service and to store your log-in credentials for that service.",
          "You may not use another User’s account without permission. When creating your account, you must provide accurate and complete information. You are solely responsible for the activity that occurs on your account, and you must keep your account password secure. We encourage you to use strong passwords (a combination of upper and lower case letters, numbers, and symbols) with your account. You must notify CSE Hub immediately of any breach of security or unauthorized use of your account. CSE Hub will not be liable for any losses caused by any unauthorized use of your account.",
          "You can control your user profile and how you interact with the Service by adjusting the settings in your account settings page. By providing CSE Hub with your email address, you consent to our use of the email address to send you Service-related notices, including those required by law, instead of postal mail. We may also use your email address to send you other messages, such as changes to Service features or special offers. If you do not wish to receive these messages, you may opt out or change your preferences in your account settings page. Opting out may prevent you from receiving updates, improvements, or offers."
        ],
        [
          "You agree not to engage in any of the following prohibited activities:",
          "CSE Hub may, without prior notice, change the Service; stop providing the Service or features of the Service to you or users generally; or create usage limits for the Service. We may permanently or temporarily terminate or suspend your access to the Service without notice and liability for any reason, including if, in our sole determination, you violate any provision of this Agreement, or for no reason. Upon termination for any reason or no reason, you continue to be bound by this Agreement.",
          "You are solely responsible for your interactions with other CSE Hub Users. We reserve the right, but have no obligation, to monitor disputes between you and other Users. CSE Hub shall have no liability for your interactions with other Users or for any User’s action or inaction."
        ]
      ],
      [
        "You agree not to post User Content that: (i) may create a risk of harm, loss, or physical or mental injury to you or others; (ii) may create a risk of any other loss or damage to any person or property; (iii) seeks to harm or exploit children by exposing them to inappropriate content or asking for personally identifiable details; (iv) may constitute or contribute to a crime or tort; (v) contains any information or content that we deem unlawful, harmful, abusive, racially or ethnically offensive, defamatory, or otherwise objectionable; (vi) contains any information or content that is illegal; (vii) contains any information or content that you do not have a right to make available under any law or contractual relationships; (viii) contains any information or content that is incorrect or not current; or (ix) violates any school or other applicable policy, including those related to cheating or ethics.",
        "You agree that any User Content you post does not and will not violate third-party rights of any kind, including but not limited to Intellectual Property Rights or rights of privacy. CSE Hub reserves the right to reject and/or remove any User Content that it believes violates these provisions. Please note that publishing your User Content on the Service is not a substitute for registering it with a relevant copyright or intellectual property rights organization.",
        "Intellectual Property Rights in this context include all rights such as patent, copyright, trademark, trade secret rights, and others that may exist under any jurisdiction.",
        "In connection with your User Content, you affirm, represent, and warrant that:",
        "CSE Hub assumes no responsibility or liability for any User Content that you or any other User or third party posts or sends over the Service. You are solely responsible for your User Content and the consequences of posting or publishing it. You understand and agree that you may be exposed to User Content that is inaccurate, objectionable, or otherwise unsuited to your purpose, and you agree that CSE Hub shall not be liable for any damages you allege to incur as a result of User Content."
      ],
      [
        "You may choose to or we may invite you to submit comments or ideas about the Service, including without limitation about how to improve the Service or our products (“Ideas”). By submitting any Idea, you agree that your disclosure is gratuitous, unsolicited, and without restriction, and will not place CSE Hub under any fiduciary or other obligation, and that we are free to use the Idea without any additional compensation to you, and/or to disclose the Idea on a non-confidential basis or otherwise to anyone. You further acknowledge that, by acceptance of your submission, CSE Hub does not waive any rights to use similar or related ideas previously known to CSE Hub, or developed by its employees, or obtained from sources other than you."
      ],
      [
        "SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO THE ABOVE EXCLUSIONS MAY NOT APPLY TO YOU. THIS AGREEMENT GIVES YOU SPECIFIC LEGAL RIGHTS, AND YOU MAY ALSO HAVE OTHER RIGHTS THAT VARY BY JURISDICTION. THE DISCLAIMERS AND EXCLUSIONS UNDER THIS AGREEMENT WILL NOT APPLY TO THE EXTENT PROHIBITED BY APPLICABLE LAW.",
        "CSE Hub DOES NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE CSE Hub SERVICE OR ANY HYPERLINKED WEBSITE OR SERVICE, AND CSE Hub WILL NOT BE A PARTY TO OR IN ANY WAY MONITOR ANY TRANSACTION BETWEEN YOU AND THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES."
      ],
      [
        "TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, CSE Hub ASSUMES NO LIABILITY OR RESPONSIBILITY FOR ANY (I) ERRORS, MISTAKES, OR INACCURACIES IN CONTENT; (II) PERSONAL INJURY OR PROPERTY DAMAGE OF ANY NATURE WHATSOEVER RESULTING FROM YOUR ACCESS TO OR USE OF OUR SERVICE; (III) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION STORED THEREIN; (IV) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SERVICE; (V) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE THAT MAY BE TRANSMITTED TO OR THROUGH OUR SERVICE BY ANY THIRD PARTY; (VI) ANY ERRORS OR OMISSIONS IN ANY CONTENT OR FOR ANY LOSS OR DAMAGE INCURRED AS A RESULT OF THE USE OF ANY CONTENT POSTED, EMAILED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE THROUGH THE SERVICE; AND/OR (VII) USER CONTENT OR THE DEFAMATORY, OFFENSIVE, OR ILLEGAL CONDUCT OF ANY THIRD PARTY. IN NO EVENT SHALL CSE Hub, ITS AFFILIATES, AGENTS, DIRECTORS, EMPLOYEES, SUPPLIERS, OR LICENSORS BE LIABLE TO YOU FOR ANY CLAIMS, PROCEEDINGS, LIABILITIES, OBLIGATIONS, DAMAGES, LOSSES, OR COSTS IN AN AMOUNT EXCEEDING THE AMOUNT YOU PAID TO CSE Hub HEREUNDER OR 10,000 DZD, WHICHEVER IS GREATER.",
        "THIS LIMITATION OF LIABILITY SECTION APPLIES WHETHER THE ALLEGED LIABILITY IS BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, OR ANY OTHER BASIS, EVEN IF CSE Hub HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. THE FOREGOING LIMITATION OF LIABILITY SHALL APPLY TO THE FULLEST EXTENT PERMITTED BY LAW IN THE APPLICABLE JURISDICTION.",
        "SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATIONS OR EXCLUSIONS MAY NOT APPLY TO YOU. THIS AGREEMENT GIVES YOU SPECIFIC LEGAL RIGHTS, AND YOU MAY ALSO HAVE OTHER RIGHTS WHICH VARY FROM JURISDICTION TO JURISDICTION. THE EXCLUSIONS AND LIMITATIONS OF LIABILITY UNDER THIS AGREEMENT WILL NOT APPLY TO THE EXTENT PROHIBITED BY APPLICABLE LAW.",
        "The Service is controlled and operated from facilities in Algeria. CSE Hub makes no representations that the Service is appropriate or available for use in other locations. Those who access or use the Service from other jurisdictions do so at their own volition and are entirely responsible for compliance with all applicable Algerian and local laws and regulations, including but not limited to export and import regulations. You may not use the Service if you are a resident of a country embargoed by Algeria, or are a foreign person or entity blocked or denied by the Algerian government. Unless otherwise explicitly stated, all materials found on the Service are solely directed to individuals, companies, or other entities located in Algeria."
      ],
      [
        [
          "You agree that: (i) the Service shall be deemed solely based in Algeria; and (ii) the Service shall be deemed a passive one that does not give rise to personal jurisdiction over CSE Hub, either specific or general, in jurisdictions other than Algeria. This Agreement shall be governed by the internal substantive laws of Algeria, without regard to its conflict of laws principles. The parties acknowledge that this Agreement evidences a transaction involving interstate commerce. Notwithstanding the preceding sentences with respect to the substantive law, any arbitration conducted pursuant to the terms of this Agreement shall be governed by Algerian arbitration law. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. You agree to submit to the personal jurisdiction of the federal and state courts located in Algeria for any actions for which we retain the right to seek injunctive or other equitable relief in a court of competent jurisdiction to prevent the actual or threatened infringement, misappropriation, or violation of CSE Hub’s copyrights, trademarks, trade secrets, patents, or other intellectual property or proprietary rights, as set forth in the Arbitration provision below."
        ],
        [
          "READ THIS SECTION CAREFULLY BECAUSE IT REQUIRES THE PARTIES TO ARBITRATE THEIR DISPUTES AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM CSE Hub. In the unlikely event that CSE Hub has not been able to resolve a dispute with you after 60 days, we each agree to resolve any claim, dispute, or controversy (excluding any CSE Hub claims for injunctive or other equitable relief) arising out of or in connection with or relating to these Terms of Service, or the breach or alleged breach thereof (collectively, “Claims”), by binding arbitration by the Algerian Chamber of Commerce and Industry (CACI) under its then-current rules, except as provided herein. The arbitration will be conducted in Algeria, unless you and CSE Hub agree otherwise. Each party will be responsible for paying any CACI filing, administrative, and arbitrator fees in accordance with CACI rules. The award rendered by the arbitrator shall include costs of arbitration, reasonable attorneys’ fees, and reasonable costs for expert and other witnesses, and any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction. Nothing in this Section shall be deemed as preventing CSE Hub from seeking injunctive or other equitable relief from the courts as necessary to protect any of CSE Hub’s proprietary interests. ALL CLAIMS MUST BE BROUGHT IN THE PARTIES’ INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS ACTION, COLLECTIVE ACTION, PRIVATE ATTORNEY GENERAL ACTION, OR OTHER REPRESENTATIVE PROCEEDING. THIS WAIVER APPLIES TO CLASS ARBITRATION, AND, UNLESS WE AGREE OTHERWISE, THE ARBITRATOR MAY NOT CONSOLIDATE MORE THAN ONE PERSON’S CLAIMS. YOU AGREE THAT, BY ENTERING INTO THESE TERMS OF SERVICE, YOU AND CSE Hub ARE EACH WAIVING THE RIGHT TO A TRIAL BY JURY OR TO PARTICIPATE IN A CLASS ACTION, COLLECTIVE ACTION, PRIVATE ATTORNEY GENERAL ACTION, OR OTHER REPRESENTATIVE PROCEEDING OF ANY KIND."
        ]
      ],
      [
        {
          "text": "You may terminate your account at any time by contacting us through our ",
          "link": {
            "text": "Help Center",
            "url": "/help"
          },
          "continuation": ". Upon receiving your termination request, CSE Hub will process it promptly, and your right to access and use the Service will immediately cease. Please note that termination of your account does not entitle you to a refund for any unused service or any fees paid prior to termination. Additionally, upon termination, CSE Hub is not obligated to store or maintain any data or content associated with your account."
        },
        [
          "CSE Hub reserves the right to suspend or terminate your account or access to the Service at any time, for any reason, including but not limited to, if you breach these Terms of Service, violate any applicable law or regulation, or engage in conduct that CSE Hub, in its sole discretion, deems inappropriate or harmful. In the event of termination by CSE Hub, you will receive a notification, and your access to the Service will be discontinued. CSE Hub may also delete any data or content associated with your account. Termination of your account by CSE Hub will not relieve you of any outstanding obligations or fees owed to CSE Hub up to the date of termination. If your account is terminated, you may not create a new account or access the Service without CSE Hub’s express permission."
        ]
      ],
      [
        [
          "This Agreement, and any rights and licenses granted hereunder, may not be transferred or assigned by you, but may be assigned by CSE Hub without restriction. Any attempted transfer or assignment in violation hereof shall be null and void."
        ],
        [
          "CSE Hub may provide notifications, whether such notifications are required by law or are for marketing or other business-related purposes, to you via email notice, written or hard copy notice, or through posting of such notice on our website, as determined by CSE Hub in our sole discretion. CSE Hub reserves the right to determine the form and means of providing notifications to our Users, provided that you may opt out of certain means of notification as described in this Agreement. CSE Hub is not responsible for any automatic filtering you or your network provider may apply to email notifications we send to the email address you provide us. CSE Hub may, in its sole discretion, modify or update this Agreement from time to time, and so you should review this page periodically. When we change the Agreement in a material manner, we will update the ‘last modified’ date at the bottom of this page. Your continued use of the Service after any such change constitutes your acceptance of the new Terms of Service. If you do not agree to any of these terms or any future Terms of Service, do not use or access (or continue to access) the Service."
        ],
        [
          "This Agreement, together with any amendments and any additional agreements you may enter into with CSE Hub in connection with the Service, shall constitute the entire agreement between you and CSE Hub concerning the Service. If any provision of this Agreement is deemed invalid by a court of competent jurisdiction, the invalidity of such provision shall not affect the validity of the remaining provisions of this Agreement, which shall remain in full force and effect, except that in the event of unenforceability of the universal Class Action/Jury Trial Waiver, the entire arbitration agreement shall be unenforceable."
        ],
        [
          "No waiver of any term of this Agreement shall be deemed a further or continuing waiver of such term or any other term, and CSE Hub’s failure to assert any right or provision under this Agreement shall not constitute a waiver of such right or provision."
        ],
        [
          "If the Service is licensed to the Algerian government or any agency thereof, then the Service will be deemed to be “commercial computer software” and “commercial computer software documentation,” respectively, pursuant to Algerian law. Any use, reproduction, release, performance, display, or disclosure of the Service and any accompanying documentation by the Algerian Government will be governed solely by these Terms of Service and is prohibited except to the extent expressly permitted by these Terms of Service."
        ],
        [
          {
            "text": "For legal notices please mail or serve us at Soumaa, Blida, 09022, Algeria. You can also contact us via our ",
            "link": {
              "text": "Help Center",
              "url": "/help"
            },
            "continuation": "."
          },
          ["This Agreement was last modified on August 18, 2024."]
        ]
      ]
    ],
    "penheads": [
      [
        {
          "text": "Copying, distributing, or disclosing any part of the Service in any medium, including automated or non-automated “scraping”;"
        },
        {
          "text": "Using any automated system, including “robots,” “spiders,” “offline readers,” etc., to access the Service in a manner that sends more request messages to the CSE Hub servers than a human can reasonably produce in the same period using a conventional web browser (except for public search engines that have permission to copy materials from CSEHub.com for publicly available searchable indices of the materials, but not caches or archives);"
        },
        {
          "text": "Transmitting spam, chain letters, or other unsolicited emails;"
        },
        {
          "text": "Attempting to interfere with, compromise system integrity or security, or decipher any transmissions to or from the servers running the Service;"
        },
        {
          "text": "Taking any action that imposes, or may impose, at our sole discretion, an unreasonable or disproportionately large load on our infrastructure;"
        },
        {
          "text": "Uploading invalid data, viruses, worms, or other software agents through the Service;"
        },
        {
          "text": "Collecting or harvesting any personally identifiable information, including account names, from the Service;"
        },
        {
          "text": "Using the Service for any commercial solicitation purposes;"
        },
        {
          "text": "Impersonating another person or otherwise misrepresenting your affiliation with a person or entity, conducting fraud, hiding, or attempting to hide your identity;"
        },
        {
          "text": "Interfering with the proper working of the Service;"
        },
        {
          "text": "Accessing any content on the Service through any technology or means other than those provided or authorized by the Service; or"
        },
        {
          "text": "Bypassing the measures we may use to prevent or restrict access to the Service, including features that prevent or restrict use or copying of any content or enforce limitations on the use of the Service or the content therein."
        }
      ],
      [
        {
          "text": "Your User Content and CSE Hub's use of it as contemplated by this Agreement and the Service will not violate any law or infringe on any third-party rights, including Intellectual Property Rights and privacy rights."
        },
        {
          "text": "CSE Hub may exercise the rights to your User Content granted under this Agreement without liability for any fees or royalties payable under any collective bargaining agreement or otherwise."
        },
        {
          "text": "To the best of your knowledge, all User Content you provide is truthful and accurate."
        },
        {
          "text": "You have the necessary consent from any identifiable persons in the User Content to use their name or likeness as contemplated by the Service and this Agreement."
        }
      ]
    ]
  }
]
